{
  "_name_or_path": "OFA-Sys/chinese-clip-vit-base-patch16",
  "architectures": [
    "ChineseCLIPModel"
  ],
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "logit_scale_init_value": 2.6592,
  "model_type": "chinese_clip",
  "projection_dim": 512,
  "text_config": {
    "architectures": [
      "ChineseCLIPTextModel"
    ],
    "bos_token_id": 0,
    "directionality": "bidi",
    "eos_token_id": 2,
    "model_type": "chinese_clip_text_model",
    "output_past": true,
    "pooler_fc_size": 768,
    "pooler_num_attention_heads": 12,
    "pooler_num_fc_layers": 3,
    "pooler_size_per_head": 128,
    "pooler_type": "first_token_transform",
    "vocab_size": 21128
  },
  "transformers_version": "4.36.0.dev0",
  "vision_config": {
    "dropout": 0.0,
    "model_type": "chinese_clip_vision_model",
    "patch_size": 16
  }
}
